tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6723_tdd.h
#define SSP1STAT_nW                   1091
#define RW                            1092
#define SSP1STAT_READ_WRITE           1093
#define SSP1STAT_nWRITE               1094
#define SSP1STAT_I2C_READ             1095
#define SSP1STAT_R_W                  1096
#define SSP1STAT_NOT_WRITE            1097
#define SSP1STAT_R_nW                 1098
#define SSP1STAT_S                    1099
#define START                         1100
#define START1                        1101
#define SSP1STAT_I2C_START            1102
#define STOP                          1103
#define SSP1STAT_P                    1104
#define STOP1                         1105
#define SSP1STAT_I2C_STOP             1106
#define SSP1STAT_D                    1107
#define SSP1STAT_D_NOT_A              1108
#define NOT_A                         1109
#define SSP1STAT_D_A                  1110
#define SSP1STAT_D_nA                 1111
#define SSP1STAT_NOT_ADDRESS          1112
#define SSP1STAT_nA                   1113
#define DA1                           1114
#define DA                            1115
#define SSP1STAT_nADDRESS             1116
#define SSP1STAT_I2C_DAT              1117
#define SSP1STAT_DATA_ADDRESS         1118
#define SSP1STAT_CKE                  1119
#define CKE1                          1120
#define SSP1STAT_SMP                  1121
#define SMP1                          1122
#define SSP1ADD                       1123
#define MSK01                         1124
#define MSK0                          1125
#define MSK11                         1126
#define MSK1                          1127
#define MSK21                         1128
#define MSK2                          1129
#define MSK3                          1130
#define MSK31                         1131
#define MSK4                          1132
#define MSK41                         1133
#define MSK51                         1134
#define MSK5                          1135
#define MSK61                         1136
#define MSK6                          1137
#define MSK71                         1138
#define MSK7                          1139
#define T2CON                         1140
#define T2CKPS0                       1141
#define T2CKPS                        1142
#define T2CKPS1                       1143
#define TMR2ON                        1144
#define T2OUTPS0                      1145
#define T2CON_TOUTPS                  1146
#define T2OUTPS1                      1147
#define T2OUTPS2                      1148
#define T2OUTPS3                      1149
#define PR2                           1150
#define WM0                           1151
#define WM1                           1152
#define WAIT0                         1153
#define WAIT1                         1154
#define EBDIS                         1155
#define T1CON                         1156
#define TMR1ON                        1157
#define TMR1CS                        1158
#define NOT_T1SYNC                    1159
#define T1SYNC                        1160
#define nT1SYNC                       1161
#define T1INSYNC                      1162
#define T1OSCEN                       1163
#define SOSCEN                        1164
#define T1CKPS0                       1165
#define T1CKPS                        1166
#define T1CKPS1                       1167
#define T1RUN                         1168
#define T1RD16                        1169
#define T1CON_RD16                    1170
#define RCON                          1171
#define BOR                           1172
#define NOT_BOR                       1173
#define nBOR                          1174
#define POR                           1175
#define nPOR                          1176
#define NOT_POR                       1177
#define PD                            1178
#define nPD                           1179
#define NOT_PD                        1180
#define NOT_TO                        1181
#define nTO                           1182
#define TO                            1183
#define nRI                           1184
#define NOT_RI                        1185
#define RI                            1186
#define SBOREN                        1187
#define IPEN                          1188
#define WDTCON                        1189
#define SWDTE                         1190
#define SWDTEN                        1191
#define HLVDCON                       1192
#define HLVDL                         1193
#define HLVDL0                        1194
#define LVV0                          1195
#define LVDL0                         1196
#define HLVDL1                        1197
#define LVDL1                         1198
#define LVV1                          1199
#define HLVDL2                        1200
#define LVV2                          1201
#define LVDL2                         1202
#define HLVDL3                        1203
#define LVV3                          1204
#define LVDL3                         1205
#define HLVDEN                        1206
#define LVDEN                         1207
#define BGST                          1208
#define IRVST                         1209
#define IVRST                         1210
#define VDIRMAG                       1211
#define OSCCON                        1212
#define SCS0                          1213
#define SCS                           1214
#define SCS1                          1215
#define FLTS                          1216
#define IOFS                          1217
#define OSTS                          1218
#define IRCF                          1219
#define IRCF0                         1220
#define IRCF1                         1221
#define IRCF2                         1222
#define IDLEN                         1223
#define T0CON                         1224
#define T0PS                          1225
#define T0PS0                         1226
#define T0PS1                         1227
#define T0PS2                         1228
#define PSA                           1229
#define T0PS3                         1230
#define T0SE                          1231
#define T0CS                          1232
#define T08BIT                        1233
#define TMR0ON                        1234
#define STATUS                        1235
#define C                             1236
#define CARRY                         1237
#define DC                            1238
#define ZERO                          1239
#define Z                             1240
#define OV                            1241
#define OVERFLOW                      1242
#define N                             1243
#define NEGATIVE                      1244
#define INTCON3                       1245
#define INT1IF                        1246
#define INT1F                         1247
#define INT2IF                        1248
#define INT2F                         1249
#define INT3F                         1250
#define INT3IF                        1251
#define INT1E                         1252
#define INT1IE                        1253
#define INT2IE                        1254
#define INT2E                         1255
#define INT3E                         1256
#define INT3IE                        1257
#define INT1P                         1258
#define INT1IP                        1259
#define INT2IP                        1260
#define INT2P                         1261
#define INTCON2                       1262
#define RBIP                          1263
#define INT3IP                        1264
#define INT3P                         1265
#define TMR0IP                        1266
#define T0IP                          1267
#define INTEDG3                       1268
#define INTEDG2                       1269
#define INTEDG1                       1270
#define INTEDG0                       1271
#define RBPU                          1272
#define NOT_RBPU                      1273
#define nRBPU                         1274
#define INTCON                        1275
#define RBIF                          1276
#define INT0F                         1277
#define INT0IF                        1278
#define T0IF                          1279
#define TMR0IF                        1280
#define RBIE                          1281
#define INT0E                         1282
#define INT0IE                        1283
#define T0IE                          1284
#define TMR0IE                        1285
#define PEIE                          1286
#define PEIE_GIEL                     1287
#define GIEL                          1288
#define GIE_GIEH                      1289
#define GIE                           1290
#define GIEH                          1291
#define STKPTR0                       1292
#define STKPTR                        1293
#define SP0                           1294
#define STKPTR1                       1295
#define SP1                           1296
#define STKPTR2                       1297
#define SP2                           1298
#define SP3                           1299
#define STKPTR3                       1300
#define STKPTR4                       1301
#define SP4                           1302
#define STKUNF                        1303
#define STKOVF                        1304
#define STKFUL                        1305

#endif // _PIC18LF6723_H_
